Revit 2027 API
ParameterTypeId.SweepBaseOffset Property
 "Horizontal Profile Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SweepBaseOffset { get; }
Public Shared ReadOnly Property SweepBaseOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SweepBaseOffset {
	ForgeTypeId^ get ();
}
static member SweepBaseOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace